Revit 2027 API
BuiltInFailures.SiteFailures.SurfaceTriangulationFailed Property
 The Site Surface failed to triangulate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceTriangulationFailed { get; }
Public Shared ReadOnly Property SurfaceTriangulationFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceTriangulationFailed {
	FailureDefinitionId^ get ();
}
static member SurfaceTriangulationFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace